brew "openjdk"
brew "ant"
brew "assimp"
brew "openssl@3"
brew "bat"
brew "cmake"
brew "cowsay"
brew "cppcheck"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fnm"
brew "fortune"
brew "fzf"
brew "python@3.13"
brew "gdb"
brew "ghostscript"
brew "git"
brew "glfw"
brew "gnu-time"
brew "gnupg"
brew "pkgconf"
brew "htop"
brew "lazygit"
brew "llvm"
brew "llvm@15"
brew "lua-language-server"
brew "mkvtoolnix"
brew "neofetch"
brew "neovim"
brew "nicotine-plus"
brew "node"
brew "opam"
brew "p7zip"
brew "pandoc"
brew "pipx"
brew "poppler"
brew "postgresql@15"
brew "python@3.10"
brew "ripgrep"
brew "rocq"
brew "ruby"
brew "stow"
brew "surfer"
brew "syncthing", restart_service: :changed
brew "texlive"
brew "tmux"
brew "tree"
brew "watch"
brew "weechat"
brew "wget"
brew "zoxide"
on_macos do
  brew "mas"

  cask "balenaetcher"
  cask "calibre"
  cask "chatgpt"
  cask "claude-code"
  cask "discord"
  cask "figma"
  cask "godot"
  cask "google-chrome"
  cask "keepingyouawake"
  cask "libreoffice"
  cask "localsend"
  cask "love"
  cask "meshlab"
  cask "minecraft"
  cask "openvpn-connect"
  cask "orbstack"
  cask "parsec"
  cask "photosrevive"
  cask "prismlauncher"
  cask "protonvpn"
  cask "qbittorrent"
  cask "scroll-reverser"
  cask "signal"
  cask "slack"
  cask "spotify"
  cask "thunderbird"
  cask "tor-browser"
  cask "visual-studio-code"
  cask "vlc"
  cask "webstorm"
  cask "wezterm"
  cask "font-hack-nerd-font"
  cask "xquartz"
  cask "zoom"

  vscode "anthropic.claude-code"
  vscode "github.copilot-chat"
  vscode "james-yu.latex-workshop"
  vscode "lucy.vscode-pink"
  vscode "mechatroner.rainbow-csv"
  vscode "mgwg.light-pink-theme"
  vscode "ms-azuretools.vscode-containers"
  vscode "ms-python.debugpy"
  vscode "ms-python.python"
  vscode "ms-python.vscode-pylance"
  vscode "ms-python.vscode-python-envs"
  vscode "ms-vscode-remote.remote-containers"
  vscode "ms-vscode-remote.remote-ssh"
  vscode "ms-vscode-remote.remote-ssh-edit"
  vscode "ms-vscode.cmake-tools"
  vscode "ms-vscode.cpp-devtools"
  vscode "ms-vscode.cpptools"
  vscode "ms-vscode.cpptools-extension-pack"
  vscode "ms-vscode.cpptools-themes"
  vscode "ms-vscode.makefile-tools"
  vscode "ms-vscode.remote-explorer"
  vscode "rocq-prover.vsrocq"
  vscode "webfreak.cute-theme"
end
